"""สร้างกล่องข้อความ"""
def main():
    """เอาจำนวนกล่องตามที่ต้องการ"""
    num = int(input())
    print("""-------------------------
|                       |
|                       |
|                       |
|   Pre-Progamming 65   |
|                       |
|                       |
|                       |
-------------------------""")
    print("""|                       |
|                       |
|                       |
|   Pre-Progamming 65   |
|                       |
|                       |
|                       |
-------------------------\n"""*(num-1), end='')
main()
